# Pandas Example 5

In [1]:
import pandas as df
import numpy as np

In [2]:
KTX_data = {u'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427], 
                u'호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228], 
                u'경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570], 
                u'전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766], 
                u'동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]} 
col_list = [u'경부선 KTX',u'호남선 KTX',u'경전선 KTX',u'전라선 KTX',u'동해선 KTX'] 
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

In [5]:
df_KTX = df.DataFrame(KTX_data, columns= col_list, index= index_list)

In [6]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [7]:
print(df_KTX.head(3))

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [8]:
print(df_KTX.tail(3))

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [11]:
print(df_KTX.loc['2013':'2016'])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

## DataFrame 행열 바꾸기

In [12]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [13]:
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0